In [1]:
import pandas as pd

In [2]:
import pickle

In [3]:
from Titanic_Test2 import lr

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Survived      891 non-null    int64
 1   Pclass        891 non-null    int64
 2   Sex           891 non-null    object
 3   Age           891 non-null    float64
 4   SibSp         891 non-null    int64
 5   Parch         891 non-null    int64
 6   Fare          891 non-null    float64
 7   Embarked      889 non-null    object
 8   AgeIsMissing  891 non-null    int64
dtypes: float64(2), int64(5), object(2)
memory usage: 62.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Survived      891 non-null    int64
 1   Pclass        891 non-null    int64
 2   Sex           891 non-null    object
 3   Age           891 non-null    float64
 4   SibSp         891 non-null    int64
 5   Parch         891 non-null    int64
 6   Fare          891 non-null    float64
 7   Embarked      891 non-null    object
 8   AgeIsMissing  891 non-null    int64
dtypes: float64(2), int64(5), object(2)
memory usage: 62.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Survived      891 non-null    int64
 1   Pclass        891 non-null    int64
 2   Sex           891 non-null    object
 3   Age           891 non-null    float64
 4   SibSp         891 non-null    int64
 5   Parch         891 non-null    int64
 6   Fare          891 non-null    float64
 7   Embarked      891 non-null    object
 8   AgeIsMissing  891 non-null    int64
 9   Age_bin       891 non-null    category
 10  Fare_bin      891 non-null    category
 11  FamilySize    891 non-null    int64
 12  IsAlone       891 non-null    int64
 13  IsMother      891 non-null    int64
 14  SexAge_Combo  891 non-null    object
dtypes: category(2), float64(2), int64(8), object(3)
memory usage: 92.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 41 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Survived                       891 non-null    int64
 1   AgeIsMissing                   891 non-null    int64
 2   IsAlone                        891 non-null    int64
 3   IsMother                       891 non-null    int64
 4   Pclass_1                       891 non-null    uint8
 5   Pclass_2                       891 non-null    uint8
 6   Pclass_3                       891 non-null    uint8
 7   Sex_female                     891 non-null    uint8
 8   Sex_male                       891 non-null    uint8
 9   Embarked_C                     891 non-null    uint8
 10  Embarked_Q                     891 non-null    uint8
 11  Embarked_S                     891 non-null    uint8
 12  Age_bin_(0, 18]                891 non-null    uint8
 13  Age_bin_(18, 25]               891 non-null    uint8
 14  Age_bin_(25, 40]               891 non-null    uint8
 15  Age_bin_(40, 60]               891 non-null    uint8
 16  Age_bin_(60, 100]              891 non-null    uint8
 17  Fare_bin_(-0.001, 7.854]       891 non-null    uint8
 18  Fare_bin_(7.854, 10.5]         891 non-null    uint8
 19  Fare_bin_(10.5, 21.679]        891 non-null    uint8
 20  Fare_bin_(21.679, 39.688]      891 non-null    uint8
 21  Fare_bin_(39.688, 512.329]     891 non-null    uint8
 22  FamilySize_1                   891 non-null    uint8
 23  FamilySize_2                   891 non-null    uint8
 24  FamilySize_3                   891 non-null    uint8
 25  FamilySize_4                   891 non-null    uint8
 26  FamilySize_5                   891 non-null    uint8
 27  FamilySize_6                   891 non-null    uint8
 28  FamilySize_7                   891 non-null    uint8
 29  FamilySize_8                   891 non-null    uint8
 30  FamilySize_11                  891 non-null    uint8
 31  SexAge_Combo_female_(0, 18]    891 non-null    uint8
 32  SexAge_Combo_female_(18, 25]   891 non-null    uint8
 33  SexAge_Combo_female_(25, 40]   891 non-null    uint8
 34  SexAge_Combo_female_(40, 60]   891 non-null    uint8
 35  SexAge_Combo_female_(60, 100]  891 non-null    uint8
 36  SexAge_Combo_male_(0, 18]      891 non-null    uint8
 37  SexAge_Combo_male_(18, 25]     891 non-null    uint8
 38  SexAge_Combo_male_(25, 40]     891 non-null    uint8
 39  SexAge_Combo_male_(40, 60]     891 non-null    uint8
 40  SexAge_Combo_male_(60, 100]    891 non-null    uint8
dtypes: int64(4), uint8(37)
memory usage: 60.2 KB
              precision    recall  f1-score   support

           0       0.82      0.81      0.81       166
           1       0.70      0.72      0.71       102

    accuracy                           0.77       268
   macro avg       0.76      0.76      0.76       268
weighted avg       0.77      0.77      0.77       268

In [4]:
titanic_df = pd.read_csv('test.csv')

In [5]:
titanic_df.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [6]:
titanic_df = titanic_df.drop(['Name','Ticket','Cabin'], axis = 1)

In [7]:
titanic_df['AgeIsMissing'] = 0

In [8]:
titanic_df.loc[titanic_df['Age'].isnull(), 'AgeIsMissing'] = 1

In [9]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   418 non-null    int64
 1   Pclass        418 non-null    int64
 2   Sex           418 non-null    object
 3   Age           332 non-null    float64
 4   SibSp         418 non-null    int64
 5   Parch         418 non-null    int64
 6   Fare          417 non-null    float64
 7   Embarked      418 non-null    object
 8   AgeIsMissing  418 non-null    int64
dtypes: float64(2), int64(5), object(2)
memory usage: 29.5+ KB

In [10]:
titanic_df['Embarked'].fillna('S', inplace=True)

In [11]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   418 non-null    int64
 1   Pclass        418 non-null    int64
 2   Sex           418 non-null    object
 3   Age           332 non-null    float64
 4   SibSp         418 non-null    int64
 5   Parch         418 non-null    int64
 6   Fare          417 non-null    float64
 7   Embarked      418 non-null    object
 8   AgeIsMissing  418 non-null    int64
dtypes: float64(2), int64(5), object(2)
memory usage: 29.5+ KB

In [12]:
cut_points = [0, 18, 25, 40, 60, 100]

In [13]:
titanic_df['AgeBin'] = pd.cut(titanic_df.Age, cut_points)

In [14]:
titanic_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,AgeIsMissing,AgeBin
0,892,3,male,34.5,0,0,7.8292,Q,0,"(25, 40]"
1,893,3,female,47.0,1,0,7.0000,S,0,"(40, 60]"
2,894,2,male,62.0,0,0,9.6875,Q,0,"(60, 100]"
3,895,3,male,27.0,0,0,8.6625,S,0,"(25, 40]"
4,896,3,female,22.0,1,1,12.2875,S,0,"(18, 25]"

In [15]:
titanic_df['FareBin'] = pd.qcut(titanic_df.Fare, 5)

In [16]:
titanic_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,AgeIsMissing,AgeBin,FareBin
0,892,3,male,34.5,0,0,7.8292,Q,0,"(25, 40]","(7.796, 11.025]"
1,893,3,female,47.0,1,0,7.0000,S,0,"(40, 60]","(-0.001, 7.796]"
2,894,2,male,62.0,0,0,9.6875,Q,0,"(60, 100]","(7.796, 11.025]"
3,895,3,male,27.0,0,0,8.6625,S,0,"(25, 40]","(7.796, 11.025]"
4,896,3,female,22.0,1,1,12.2875,S,0,"(18, 25]","(11.025, 21.438]"

In [17]:
titanic_df['FamilySize'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1

In [18]:
titanic_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,AgeIsMissing,AgeBin,FareBin,FamilySize
0,892,3,male,34.5,0,0,7.8292,Q,0,"(25, 40]","(7.796, 11.025]",1
1,893,3,female,47.0,1,0,7.0000,S,0,"(40, 60]","(-0.001, 7.796]",2
2,894,2,male,62.0,0,0,9.6875,Q,0,"(60, 100]","(7.796, 11.025]",1
3,895,3,male,27.0,0,0,8.6625,S,0,"(25, 40]","(7.796, 11.025]",1
4,896,3,female,22.0,1,1,12.2875,S,0,"(18, 25]","(11.025, 21.438]",3

In [19]:
titanic_df['IsAlone'] = 0

In [20]:
titanic_df.loc[titanic_df['FamilySize'] == 1, 'IsAlone'] = 1

In [21]:
titanic_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,AgeIsMissing,AgeBin,FareBin,FamilySize,IsAlone
0,892,3,male,34.5,0,0,7.8292,Q,0,"(25, 40]","(7.796, 11.025]",1,1
1,893,3,female,47.0,1,0,7.0000,S,0,"(40, 60]","(-0.001, 7.796]",2,0
2,894,2,male,62.0,0,0,9.6875,Q,0,"(60, 100]","(7.796, 11.025]",1,1
3,895,3,male,27.0,0,0,8.6625,S,0,"(25, 40]","(7.796, 11.025]",1,1
4,896,3,female,22.0,1,1,12.2875,S,0,"(18, 25]","(11.025, 21.438]",3,0

In [22]:
titanic_df['IsMother'] = 0

In [23]:
titanic_df.loc[(titanic_df.Sex == 'female') & (titanic_df.Parch > 0) & (titanic_df.Age > 20), 'IsMother'] = 1

In [24]:
titanic_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,AgeIsMissing,AgeBin,FareBin,FamilySize,IsAlone,IsMother
0,892,3,male,34.5,0,0,7.8292,Q,0,"(25, 40]","(7.796, 11.025]",1,1,0
1,893,3,female,47.0,1,0,7.0000,S,0,"(40, 60]","(-0.001, 7.796]",2,0,0
2,894,2,male,62.0,0,0,9.6875,Q,0,"(60, 100]","(7.796, 11.025]",1,1,0
3,895,3,male,27.0,0,0,8.6625,S,0,"(25, 40]","(7.796, 11.025]",1,1,0
4,896,3,female,22.0,1,1,12.2875,S,0,"(18, 25]","(11.025, 21.438]",3,0,1

In [25]:
titanic_df['SexAgeCombo'] = titanic_df['Sex'] + '_' + titanic_df['AgeBin'].astype(str)

In [26]:
titanic_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,AgeIsMissing,AgeBin,FareBin,FamilySize,IsAlone,IsMother,SexAgeCombo
0,892,3,male,34.5,0,0,7.8292,Q,0,"(25, 40]","(7.796, 11.025]",1,1,0,"male_(25, 40]"
1,893,3,female,47.0,1,0,7.0000,S,0,"(40, 60]","(-0.001, 7.796]",2,0,0,"female_(40, 60]"
2,894,2,male,62.0,0,0,9.6875,Q,0,"(60, 100]","(7.796, 11.025]",1,1,0,"male_(60, 100]"
3,895,3,male,27.0,0,0,8.6625,S,0,"(25, 40]","(7.796, 11.025]",1,1,0,"male_(25, 40]"
4,896,3,female,22.0,1,1,12.2875,S,0,"(18, 25]","(11.025, 21.438]",3,0,1,"female_(18, 25]"

In [27]:
Pclass = pd.get_dummies(titanic_df.Pclass, prefix='Pclass')

In [28]:
Sex = pd.get_dummies(titanic_df.Sex, prefix='Sex')

In [29]:
Embarked = pd.get_dummies(titanic_df.Embarked, prefix='Embarked')

In [30]:
AgeBin = pd.get_dummies(titanic_df.AgeBin, prefix='AgeBin')

In [31]:
FareBin = pd.get_dummies(titanic_df.FareBin, prefix='FareBin')

In [32]:
FamilySize = pd.get_dummies(titanic_df.FamilySize, prefix='FamilySize')

In [33]:
SexAgeCombo = pd.get_dummies(titanic_df.SexAgeCombo, prefix='SexAgeCombo')

In [34]:
TestData = pd.concat([titanic_df[['PassengerId', 'AgeIsMissing', 'IsAlone', 'IsMother']], Pclass, Sex, Embarked, AgeBin, FareBin, FamilySize, SexAgeCombo], axis=1)

In [35]:
TestData.head()

,PassengerId,AgeIsMissing,IsAlone,IsMother,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,...,"SexAgeCombo_female_(0, 18]","SexAgeCombo_female_(18, 25]","SexAgeCombo_female_(25, 40]","SexAgeCombo_female_(40, 60]","SexAgeCombo_female_(60, 100]","SexAgeCombo_male_(0, 18]","SexAgeCombo_male_(18, 25]","SexAgeCombo_male_(25, 40]","SexAgeCombo_male_(40, 60]","SexAgeCombo_male_(60, 100]"
0,892,0,1,0,0,0,1,0,1,0,...,0,0,0,0,0,0,0,1,0,0
1,893,0,0,0,0,0,1,1,0,0,...,0,0,0,1,0,0,0,0,0,0
2,894,0,1,0,0,1,0,0,1,0,...,0,0,0,0,0,0,0,0,0,1
3,895,0,1,0,0,0,1,0,1,0,...,0,0,0,0,0,0,0,1,0,0
4,896,0,0,1,0,0,1,1,0,0,...,0,1,0,0,0,0,0,0,0,0

In [36]:
TestData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 41 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   PassengerId                   418 non-null    int64
 1   AgeIsMissing                  418 non-null    int64
 2   IsAlone                       418 non-null    int64
 3   IsMother                      418 non-null    int64
 4   Pclass_1                      418 non-null    uint8
 5   Pclass_2                      418 non-null    uint8
 6   Pclass_3                      418 non-null    uint8
 7   Sex_female                    418 non-null    uint8
 8   Sex_male                      418 non-null    uint8
 9   Embarked_C                    418 non-null    uint8
 10  Embarked_Q                    418 non-null    uint8
 11  Embarked_S                    418 non-null    uint8
 12  AgeBin_(0, 18]                418 non-null    uint8
 13  AgeBin_(18, 25]               418 non-null    uint8
 14  AgeBin_(25, 40]               418 non-null    uint8
 15  AgeBin_(40, 60]               418 non-null    uint8
 16  AgeBin_(60, 100]              418 non-null    uint8
 17  FareBin_(-0.001, 7.796]       418 non-null    uint8
 18  FareBin_(7.796, 11.025]       418 non-null    uint8
 19  FareBin_(11.025, 21.438]      418 non-null    uint8
 20  FareBin_(21.438, 46.62]       418 non-null    uint8
 21  FareBin_(46.62, 512.329]      418 non-null    uint8
 22  FamilySize_1                  418 non-null    uint8
 23  FamilySize_2                  418 non-null    uint8
 24  FamilySize_3                  418 non-null    uint8
 25  FamilySize_4                  418 non-null    uint8
 26  FamilySize_5                  418 non-null    uint8
 27  FamilySize_6                  418 non-null    uint8
 28  FamilySize_7                  418 non-null    uint8
 29  FamilySize_8                  418 non-null    uint8
 30  FamilySize_11                 418 non-null    uint8
 31  SexAgeCombo_female_(0, 18]    418 non-null    uint8
 32  SexAgeCombo_female_(18, 25]   418 non-null    uint8
 33  SexAgeCombo_female_(25, 40]   418 non-null    uint8
 34  SexAgeCombo_female_(40, 60]   418 non-null    uint8
 35  SexAgeCombo_female_(60, 100]  418 non-null    uint8
 36  SexAgeCombo_male_(0, 18]      418 non-null    uint8
 37  SexAgeCombo_male_(18, 25]     418 non-null    uint8
 38  SexAgeCombo_male_(25, 40]     418 non-null    uint8
 39  SexAgeCombo_male_(40, 60]     418 non-null    uint8
 40  SexAgeCombo_male_(60, 100]    418 non-null    uint8
dtypes: int64(4), uint8(37)
memory usage: 28.3 KB

In [37]:
Test_X = TestData.drop(['PassengerId'], axis=1)

In [38]:
pred = lr.predict(Test_X)

In [39]:
print(pred)

[0 0 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 1 1 0 0 1 0 1 0 1 0 0 0 0 0 1 1 1 0 1
 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 1 1 1 0 1 1
 1 1 0 1 0 1 1 0 0 0 0 0 1 1 1 1 1 0 1 0 0 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 1 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 1 0
 0 0 1 0 0 1 0 0 1 1 0 1 1 1 1 0 0 1 0 0 1 1 0 0 0 0 0 1 1 0 1 1 0 1 1 0 1
 0 1 0 0 0 0 0 0 0 1 0 1 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 1 1 0 0 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 1 1 0 0 1 0 0 0 1 1 1 1 1 0 0 0 1 0 1 1 1 0 1 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 1 0 0 0 1 1 0 1 0 0 0 0 1 0 1 1 1 0 0 0 0 0 0 1 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 1 0 0 1 0 0 0 1 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 1 0 1 1 0 1 0 1 0 1 0 0 1 0 1 1 0 1 0 0 1 1 0
 0 1 0 0 1 1 1 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 1 0 1 1 0 0 0
 1 1 1 1 1 1 0 1 0 0 0]

In [40]:
round(pred.sum()/pred.size, 4)

0.4067

In [41]:
Submission = pd.DataFrame({'PassengerId':TestData.PassengerId, 'Survived':pred})

In [42]:
Submission

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [43]:
Submission.to_csv("Submission.csv", index=False)

In [44]:
submission_df = pd.read_csv('Submission.csv')

In [45]:
submission_df.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [46]:
# Now that we save the prediction as a file, we need to store the model as well

In [47]:
type(lr)

sklearn.linear_model._logistic.LogisticRegression

In [48]:
with open('lrmodel.pickle', 'wb') as f:
    pickle.dump(lr, f)

In [49]:
# EOF